<template>
  <div class="demo">
    <div class="left-tree">
      <ul>
        <li v-for="item of videoData" :key="item.id" @click="chooseCamera(item)">
          <span>{{item.cameraName}}</span>
        </li>
      </ul>
    </div>

    <div class="right-play">
      <div class="grid-content">
        <div>
          <i class="iconfont icon-fenpingfangshi2" title="一屏" @click="chooseSplitScreen(1)"></i>
          <i class="iconfont icon-fenpin2" title="四屏" @click="chooseSplitScreen(4)"></i>
          <i class="iconfont icon-fenpingfangshi" title="九屏" @click="chooseSplitScreen(9)"></i>
          <i class="iconfont icon-fenpingfangshi1" title="十六屏" @click="chooseSplitScreen(16)"></i>
        </div>
      </div>
      <div class="play-content">
        <xg-player
          :live="live"
          :split-screen="splitScreen"
          :video-list="videoList"
          :pip="true"
          :definition-list="definitionList"
        >
        </xg-player>
        <!--<xg-player
          :live="live"
          :pip="true"
          :video-url="url"
        >
        </xg-player>-->

      </div>
    </div>


  </div>

</template>

<script>
  // 引入西瓜视频组件
  import xgPlayer from '../components/xgPlayer'

  export default {
    name: "demo",
    components: {
      xgPlayer
    },
    data() {
      return {
        url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591160434_1591160499.m3u8',
        live: true,
        splitScreen: 1,
        // 与播放器内部数据数组指向同一地址
        videoList: [],
        // 测试视频数据
        videoData: [
          {
            cameraId: '1001',
            cameraName: '一楼办公室',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1590735411_1590735458.m3u8',
            // url: 'rtsp://Inphase:2KE496r8a@182.145.195.233:9500/DevCode=08102021122A3A0C400/DevAor=08102021122A3A0C400/StreamIndex=0',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },

          },
          {
            cameraId: '1002',
            cameraName: '二楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1590560816_1590560878.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1003',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591160434_1591160499.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
              ]
            },
          },
          {
            cameraId: '1004',
            cameraName: '一楼办公室右侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },
          {
            cameraId: '1005',
            cameraName: '三楼办公室左侧',
            url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
            danmu: {
              comments: [
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '1', //弹幕id，需唯一
                  start: 3000, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },
                {
                  duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
                  id: '2', //弹幕id，需唯一
                  start: 3500, //弹幕出现时间，毫秒
                  txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
                },

              ]

            },
          },

        ],
        // 视频清晰度数据
        definitionList: [
         /* {name: '高清', url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8'},
          {name: '超清', url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591160434_1591160499.m3u8'}*/
        ]
      }
    },
    created() {

    },
    methods: {
      /**
       * @description 切换分屏数
       * @param num {Number} - 分屏数
       * @return {null}
       */
      chooseSplitScreen(num) {
        this.splitScreen = num
      },
      /**
       * @description 选择播放视频
       * @param item {Object} -  视频对象
       * @return  {null}
       */
      chooseCamera(item) {
        // 多个视频源播放
        this.videoList.push(item)
        // 单个视频源切换
        // this.url = item.url
      }

    },
  }
</script>

<style lang="less" scoped>
  .demo {
    width: 100%;
    height: 100vh;
    display: flex;

    .left-tree {
      width: 15%;
      height: 100%;
      background-color: #f1f1f1;

      ul {
        .active-camera {
          color: #669ff3;
        }

        li {
          height: 35px;
          line-height: 35px;

          span {
            cursor: pointer;
          }
        }
      }
    }

    .right-play {
      width: 85%;
      height: 100%;

      .play-content {
        width: 100%;
        height: 100vh;
        /*background-color: #cecece;*/
      }

    }
  }
</style>
