export default [
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1001',
    cameraName: '11111',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1590735411_1590735458.m3u8',
    // url: 'rtsp://Inphase:2KE496r8a@182.145.195.233:9500/DevCode=08102021122A3A0C400/DevAor=08102021122A3A0C400/StreamIndex=0',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },

  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1002',
    cameraName: '22222',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591820219_1591820261.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1003',
    cameraName: '333333',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591160434_1591160499.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
      ]
    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1004',
    cameraName: '444444',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591257957_1591258080.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '555555',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591771140_1591771203.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '666666',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591771014_1591771036.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '777777',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591760281_1591760326.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '888888',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591283991_1591284036.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '9999999',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591280979_1591281029.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: 'tententen',
    url: 'http://222.213.16.51:8050/M3u8File?01104849A400571E500_01104849A400571E500_1591280370_1591280432.m3u8',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
]
