export default [
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4'
      },
      {
        name: '高清',
        url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4'
      },
      {
        name: '超清',
        url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4'
      }
    ],
    cameraId: '1001',
    cameraName: '天下',
    url: 'http://vfx.mtime.cn/Video/2019/03/17/mp4/190317150237409904.mp4',
    // url: 'rtsp://Inphase:2KE496r8a@182.145.195.233:9500/DevCode=08102021122A3A0C400/DevAor=08102021122A3A0C400/StreamIndex=0',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },

  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      },
      {
        name: '高清',
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      },
      {
        name: '超清',
        url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4'
      }
    ],
    cameraId: '1002',
    cameraName: '紧急救援',
    url: 'http://vfx.mtime.cn/Video/2019/03/21/mp4/190321153853126488.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1003',
    cameraName: '惊奇队长',
    url: 'http://vfx.mtime.cn/Video/2019/03/19/mp4/190319222227698228.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
      ]
    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1004',
    cameraName: '叶问4',
    url: 'http://vfx.mtime.cn/Video/2019/03/18/mp4/190318231014076505.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '刘德华',
    url: 'http://vfx.mtime.cn/Video/2019/03/18/mp4/190318231014076505.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '雷霆沙赞',
    url: 'http://vfx.mtime.cn/Video/2019/03/14/mp4/190314102306987969.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '日本动漫',
    url: 'http://vfx.mtime.cn/Video/2019/03/09/mp4/190309153658147087.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '其乐无穷',
    url: 'http://vfx.mtime.cn/Video/2019/03/12/mp4/190312083533415853.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '地久天长',
    url: 'http://vfx.mtime.cn/Video/2019/03/12/mp4/190312143927981075.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },
  {
    definitionList: [ //  清晰度数据
      {
        name: '标清', // 渲染为清晰度切换播放栏选项
        url: ''
      },
      {
        name: '高清',
        url: ''
      },
      {
        name: '超清',
        url: ''
      }
    ],
    cameraId: '1005',
    cameraName: '迪士尼公主',
    url: 'http://vfx.mtime.cn/Video/2019/03/13/mp4/190313094901111138.mp4',
    danmu: {
      comments: [
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '1', //弹幕id，需唯一
          start: 3000, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },
        {
          duration: 15000, //弹幕持续显示时间,毫秒(最低为5000毫秒)
          id: '2', //弹幕id，需唯一
          start: 3500, //弹幕出现时间，毫秒
          txt: '长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕长弹幕', //弹幕文字内容
        },

      ]

    },
  },

]
